Notes on SCR from LSL for ABL.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-03-27 Tue 18:53 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Notes taken from "Source Code Retrieval from Large Software Libraries for Automatic.pdf"</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Shane Mulligan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Notes taken from "Source Code Retrieval from Large Software Libraries for Automatic.pdf"</h1>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Author</b></td>
<td class="org-left">Shane Mulligan (<a href="mailto:mullikine@gmail.com">mailto:mullikine@gmail.com</a>)</td>
</tr>

<tr>
<td class="org-left"><b>Date</b></td>
<td class="org-left">2018-03-27 18:53:33</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgdbde81f" class="outline-2">
<h2 id="orgdbde81f"><span class="section-number-2">1</span> External</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="file:///home/shane/dump/home/shane/notes2018/uni/cosc/480-project_FY/research/Source Code Retrieval from Large Software Libraries for Automatic.pdf">SCR from LSL for ABL.pdf</a>
</p>

<div class="org-src-container">
<pre class="src src-bash">reading +1 source code retrieval large <span style="color: #fa8072;">` # Chapter 1: Introduction `</span>
reading +7 source code retrieval large <span style="color: #fa8072;">` # Chapter 2: Related Work `</span>
reading +12 source code retrieval large <span style="color: #fa8072;">` # Chapter 3: Models for Document Retrieval `</span>
reading +25 source code retrieval large <span style="color: #fa8072;">` # Chapter 4: Information Retrieval For Bug Localization `</span>
reading +31 source code retrieval large <span style="color: #fa8072;">` # Chapter 5: Incorporating Version Histories In Ir-Based Bug Localization `</span>
reading +51 source code retrieval large <span style="color: #fa8072;">` # Chapter 6: Assisting Code Search With Automatic Query Reformulation For Bug Localization `</span>
reading +79 source code retrieval large <span style="color: #fa8072;">` # Chapter 7: Exploiting Source Code Proximity And Order With Markov Random Fields `</span>
reading +109 source code retrieval large <span style="color: #fa8072;">` # Chapter 8: A Retrieval Engine For Bug Localization:Terrier+ `</span>
reading +114 source code retrieval large <span style="color: #fa8072;">` # Chapter 9: Conclusions `</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga76a9ed" class="outline-2">
<h2 id="orga76a9ed"><span class="section-number-2">2</span> Summaries</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge2923d2" class="outline-3">
<h3 id="orge2923d2"><span class="section-number-3">2.1</span> Chapter 3: Models for Document Retrieval</h3>
<div class="outline-text-3" id="text-2-1">
<dl class="org-dl">
<dt>TF-IDF</dt><dd>Used instead of TF within a document-term matrix so common words like 'it' are less frequent.</dd>
<dt>d-t Matrix</dt><dd>columns are vectors of word frequencies or of TF-IDFs. Rows are the word/term frequencies.</dd>
<dt>VSM</dt><dd>Uses simple word frequency vectors to represent a document.</dd>
<dt>DFR Framework</dt><dd>Divergence from Randomness Framework</dd>
</dl>
</div>

<div id="outline-container-org72589e9" class="outline-4">
<h4 id="org72589e9"><span class="section-number-4">2.1.1</span> DFR Framework</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
An important class of retrieval models are grouped under the DFR Framework.
It's an information theoretic approach that evaluates the appropriateness of a document to a query on the basis.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc7993d7" class="outline-3">
<h3 id="orgc7993d7"><span class="section-number-3">2.2</span> Chapter 4: Information Retrieval for Bug Localisation</h3>
</div>
<div id="outline-container-org3058288" class="outline-3">
<h3 id="org3058288"><span class="section-number-3">2.3</span> Chapter 5: Incorporating Version Histories in IR-Based Bug Localisation</h3>
</div>
<div id="outline-container-org1791eb0" class="outline-3">
<h3 id="org1791eb0"><span class="section-number-3">2.4</span> Chapter 6: Assisting Code Search With Automatic Query Reformulation for Bug Localisation</h3>
</div>
<div id="outline-container-org6915735" class="outline-3">
<h3 id="org6915735"><span class="section-number-3">2.5</span> Chapter 7: Exploiting Source Code Proximity And Order With Markov Random Fields</h3>
</div>
<div id="outline-container-org0c98c62" class="outline-3">
<h3 id="org0c98c62"><span class="section-number-3">2.6</span> Chapter 8: A Retrieval Engine for Bug Localisation: Terrier+</h3>
</div>
<div id="outline-container-org0d7fc33" class="outline-3">
<h3 id="org0d7fc33"><span class="section-number-3">2.7</span> Conclusions</h3>
</div>
</div>

<div id="outline-container-org2d1be19" class="outline-2">
<h2 id="org2d1be19"><span class="section-number-2">3</span> Terms</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org6b8a61d" class="outline-3">
<h3 id="org6b8a61d"><span class="section-number-3">3.1</span> Information theoretic :: regarding information theory</h3>
</div>
<div id="outline-container-org79ec780" class="outline-3">
<h3 id="org79ec780"><span class="section-number-3">3.2</span> Information theory :: studies the quantification, storage, and communication of information.</h3>
</div>
</div>

<div id="outline-container-orgde01fc0" class="outline-2">
<h2 id="orgde01fc0"><span class="section-number-2">4</span> Refactorings</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>parens to def :: '&lt;,'&gt;s/\(.*\)(\(.*\))/\1:: \2/g</li>
</ol>
</div>
</div>

<div id="outline-container-orgf3d3857" class="outline-2">
<h2 id="orgf3d3857"><span class="section-number-2">5</span> Notation</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org4396284" class="outline-3">
<h3 id="org4396284"><span class="section-number-3">5.1</span> SBM</h3>
<div class="outline-text-3" id="text-5-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">symbol</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">F</td>
<td class="org-left">RFn</td>
</tr>

<tr>
<td class="org-left">Q</td>
<td class="org-left">[01] statement about a query</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">[01] algebra over a set of words</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">[01] rep. of a d in the C</td>
</tr>

<tr>
<td class="org-left">q<sub>i</sub></td>
<td class="org-left">[01] rep. of i<sup>th</sup> word in a q</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org7babeb0" class="outline-2">
<h2 id="org7babeb0"><span class="section-number-2">6</span> Prp Method in this Dissertation:</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org43d3d7c" class="outline-3">
<h3 id="org43d3d7c"><span class="section-number-3">6.1</span> Domain</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Large and changing
</p>
</div>
</div>
<div id="outline-container-org1ac44e6" class="outline-3">
<h3 id="org1ac44e6"><span class="section-number-3">6.2</span> Apparatus</h3>
<div class="outline-text-3" id="text-6-2">
<ol class="org-ol">
<li>BF</li>
<li>QRM</li>
</ol>
</div>
</div>
<div id="outline-container-orgf78cdbe" class="outline-3">
<h3 id="orgf78cdbe"><span class="section-number-3">6.3</span> Steps</h3>
<div class="outline-text-3" id="text-6-3">
<ol class="org-ol">
<li>Create BF &#x2013; Predict Bug Li</li>
<li>Describe QR Model. PRF with SCP.</li>
<li>Present a RMF</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgd227ca9" class="outline-2">
<h2 id="orgd227ca9"><span class="section-number-2">7</span> Ambiguous Terms</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li><b>DR</b> :: dimensionality reduction</li>
<li><p>
LT :: Linear Transformation techniques
</p>

<p>
Commonly used for DR
</p>

<ol class="org-ol">
<li><b>LDA</b> :: Linear Discriminant Analysis</li>
<li>PCA :: Principal Component Analysis</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-org9e7e296" class="outline-2">
<h2 id="org9e7e296"><span class="section-number-2">8</span> Models</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>QRM :: Query Reformulation Model</li>
<li>SBM :: Standard Boolean Model</li>
<li>VSM / BoWM :: Vector Space Model / Bag of Words Model</li>
<li>TFIM :: TF-IDF Models</li>
<li>TFIRM :: TF-IDF Retrieval Models</li>
<li>UM :: Unigram Model</li>
<li>PTM :: Probabilistic Topic Models</li>
<li>LM :: Lanugage Model</li>
<li>RM :: Retrieval Models</li>
<li>LM + BoWM = Unigram Model</li>
<li>MHbP Model</li>
<li>HDbP Model</li>
</ol>
</div>
</div>

<div id="outline-container-orgba25443" class="outline-2">
<h2 id="orgba25443"><span class="section-number-2">9</span> Terms</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>RFn :: Retrieval Function</li>
<li>[01] :: Boolean</li>
<li>LSL :: Large Software Libraries</li>
<li>LSI :: Latent Semantic Indexing</li>
<li>ABL :: Automatic Bug Localisation</li>
<li>m :: method</li>
<li>Hm :: Hybrid method / approach</li>
<li>SS :: Search Space</li>
<li>SPR :: Scenario-based Probabilistic Ranking</li>
<li>FCA :: Formal Concept Analysis</li>
<li>M :: Model</li>
<li>d :: document</li>
<li>Li :: Liklihood</li>
<li>Prp :: Proposed by this dissertation</li>
<li>PrpA :: Proposed Approach</li>
<li>Ralg :: Relevance Algorithm</li>
<li>IN :: Information Need</li>
<li>BL :: Bug Localisation</li>
<li>QR :: Query Reformulation</li>
<li>QRM :: Query Reformulation Model</li>
<li>SCR / CS :: Source Code Retrieval / Code Search</li>
<li>Dm :: Dynamic methods / approach</li>
<li>Sm :: Static methods / approach</li>
<li>IRm :: IR methods</li>
<li>SBM :: Standard Boolean Model</li>
<li>VSM / BoW / BowM :: Vector Space Model / Bag of Words / BoW Model</li>
<li>BoWa :: BoW assumption</li>
<li>DFR :: Divergence From Randomness</li>
<li>TFIM :: TF-IDF Models</li>
<li>TFIRM :: TF-IDF Retrieval Models</li>
<li>BF / PF :: Bayesian framework / Probabilistic framework</li>
<li>ICN :: Information Content Normalisation</li>
<li>DLN :: Document Length Normalisation</li>
<li>UM :: Unigram Model</li>
<li>PTM :: Probabilistic Topic Models</li>
<li>MU :: Mixture of Unigrams</li>
<li>pLSA :: Probabilistic Latent Semantic Analysis</li>
<li>LDA :: Latent Dirichlet Allocation</li>
<li>DR :: Document Retrieval</li>
<li>LM :: Lanugage Modelling</li>
<li>RM :: Retrieval Models</li>
<li>PD :: Probability Distribution</li>
<li>P1 :: Probability 1</li>
<li>P2 :: Probability 2</li>
<li>VH :: Version Histories</li>
<li>Pr / PP / PrP :: Priors / Prior Probabilities</li>
<li>D+M :: Defect + Modification</li>
<li>TD :: Temporal Decay</li>
<li>DPr :: Document Priors</li>
<li>DP :: Document Preparation</li>
<li>QR :: Query Reformulation</li>
<li>AQR :: Automatic Query Reformulation</li>
<li>ERF :: Explicit Relevance Feedback</li>
<li>PRF :: Pseudo Relevance Feedback</li>
<li>SCP :: Spacial Code Proximity</li>
<li>rFm :: Rocchio's Formula</li>
<li>iTh :: Information Theoretic</li>
<li>RR :: Retrieval Results</li>
<li>RS :: Retrieval Score</li>
<li>DRT :: Document Retrieval Techniques</li>
<li>MRF / RMF :: Markov Random Field / Random Markov Field</li>
<li>Wf :: Word Frequencies</li>
<li>qW :: Query Words</li>
<li>q :: Query</li>
<li>IaR :: Interactive Refinement</li>
<li>NL :: Natural Language</li>
<li>C :: Document Collection / Text Corpus</li>
</ol>
</div>
</div>

<div id="outline-container-orgd9676da" class="outline-2">
<h2 id="orgd9676da"><span class="section-number-2">10</span> Math (get correct symbols)</h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li>BoW :: ∀x; x ∈ A
Each d is a vector of Wf.</li>
</ol>
</div>
</div>

<div id="outline-container-org8a87a3c" class="outline-2">
<h2 id="org8a87a3c"><span class="section-number-2">11</span> Definitions</h2>
<div class="outline-text-2" id="text-11">
<ol class="org-ol">
<li>P1
The probability of having tf occurrences of the term in the document by pure chance.
   As this decreases, the information content of the document (vis-a-vis/in relation with) the term increases.</li>
<li><p>
P2
(1 - P2) is related to the risk of choosing the query term as a discriminative term and works as a normalization factor.
</p>

<p>
Can be used as the probability of having one more occurrence of the term in the document, which leads to penalizting the high frequency terms during retrieval.
</p></li>
<li>BoWa :: Each word is sampled independantly from the rest of the words in the document.</li>
<li>BoW / VSM :: A simplifying representation. Each d is a vector of Wf.</li>
<li>LSI :: An early retrieval method.
Assign greater importance to terms that frequently co-occur in source files.
Can use to expand a given initial query that consists of a single query term initially.</li>
</ol>
</div>
</div>

<div id="outline-container-org00b8ff5" class="outline-2">
<h2 id="org00b8ff5"><span class="section-number-2">12</span> Notes</h2>
<div class="outline-text-2" id="text-12">
<ol class="org-ol">
<li>Ignore structure but perform well:
<ol class="org-ol">
<li>LM + BoW = Unigram Model</li>
<li>iTh + BoW = TF-IDF</li>
</ol></li>
<li>BoWa != BoWM</li>
</ol>
</div>
</div>

<div id="outline-container-orgc4fb141" class="outline-2">
<h2 id="orgc4fb141"><span class="section-number-2">13</span> Annotations</h2>
<div class="outline-text-2" id="text-13">
<ol class="org-ol">
<li>MFR</li>
<li>TF-IDF :: Still Competative</li>
<li>DRT using BoW
<ol class="org-ol">
<li>LM :: Uses a PF</li>
<li>DFR :: iTh</li>
</ol></li>
<li>BoW :: Given a set of documents, allows you to rank them</li>
<li>RMF :: Benefit over Traditional BL is IaR
Exploits SCP</li>
<li>SBM :: Gives us Logical Operators in our search queries
But lacks the notion of ranking.</li>
<li>RS :: The higher the RS, the more relevant.</li>
<li>Hm :: Combinations of Dm, Sm and IR to narrow down the SS with Dm then use Sm on a smaller SS for better accuracy.</li>
<li><p>
SPR :: Assigns 2 probabilities to the methods in the execution traces:
</p>
<ol class="org-ol">
<li>One indicates the probability of the method to exercise the feature; and</li>
<li>the other NOT to.</li>
</ol>

<p>
Based on these probabilities, the method is classified as either relevant or irrelevant.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgf656292" class="outline-2">
<h2 id="orgf656292"><span class="section-number-2">14</span> Uses</h2>
<div class="outline-text-2" id="text-14">
<ol class="org-ol">
<li>Bug report is used as a query</li>
</ol>
</div>
</div>

<div id="outline-container-orge734ee4" class="outline-2">
<h2 id="orge734ee4"><span class="section-number-2">15</span> Problem =&gt; Solution</h2>
<div class="outline-text-2" id="text-15">
<ol class="org-ol">
<li>MRF =&gt; IR defect, Loss of inter-term relationships in documents</li>
</ol>
</div>
</div>

<div id="outline-container-orgadb0736" class="outline-2">
<h2 id="orgadb0736"><span class="section-number-2">16</span> IN</h2>
<div class="outline-text-2" id="text-16">
<ol class="org-ol">
<li>Concept Localisation</li>
<li>Bug Localisation</li>
<li>Change Impact Analysis</li>
<li>Traceability</li>
<li>Link Recovery</li>
</ol>
</div>
</div>

<div id="outline-container-orge5d8739" class="outline-2">
<h2 id="orge5d8739"><span class="section-number-2">17</span> Outline</h2>
<div class="outline-text-2" id="text-17">
<ol class="org-ol">
<li>Traditional BL Methods
<ol class="org-ol">
<li>SCA :: Static Code Analysis
Need a call graph.
Can't deal with non-executable files.</li>
<li>Dynamic :: Test cases / Debugger
Can't make an exhaustive set.
Also, can't deal with non-executable files.</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-org3497b0f" class="outline-2">
<h2 id="org3497b0f"><span class="section-number-2">18</span> Outline</h2>
<div class="outline-text-2" id="text-18">
<ol class="org-ol">
<li>IR for BL</li>
<li>Organisation of this dissertation</li>
<li>Dm</li>
<li>Sm</li>
<li>IR Methods</li>
<li>Hm</li>
<li>SBM</li>
<li>VSM</li>
<li>DFR
<ol class="org-ol">
<li>Using different PD in IC
<ol class="org-ol">
<li>P1</li>
<li>P2</li>
</ol></li>
<li>TFIM for P1</li>
<li>ICN (P2)</li>
<li>DLN</li>
</ol></li>
<li>UM</li>
<li>PTM</li>
<li>MU</li>
<li>pLSA</li>
<li>LDA</li>
<li>DR with PTM</li>
<li>IR for BL</li>
<li>LM</li>
<li>TFIRM</li>
<li>Incorporating VH in IR-based BL</li>
<li>Estimating D+M -based PrP</li>
<li>MHbP Model</li>
<li>HDbP Model</li>
<li>M the Pr with TD</li>
<li>BF for BL</li>
<li>DPr</li>
<li>Experimental Evaluation</li>
<li>DP for BL with VH</li>
<li>RR</li>
<li>Assisting CS with AQR for BL</li>
<li>ERF</li>
<li>PRF</li>
<li>rFm for AQR</li>
<li>AQR using the RM.</li>
<li>The PrpA to QR for SCR</li>
<li>Wf</li>
</ol>
</div>
</div>

<div id="outline-container-orgb849503" class="outline-2">
<h2 id="orgb849503"><span class="section-number-2">19</span> M for NL DR</h2>
<div class="outline-text-2" id="text-19">
<dl class="org-dl">
<dt>SBM</dt><dd>DR is performed on the basis of presense of qW in the C.</dd>
</dl>
<p>
Not indicate any word more important than others, makes any logical query possible.
</p>
<dl class="org-dl">
<dt>SBM</dt><dd>Bool Logic &amp; Set Theory</dd>
</dl>
</div>
</div>

<div id="outline-container-org44ed7c7" class="outline-2">
<h2 id="org44ed7c7"><span class="section-number-2">20</span> Official Terms</h2>
<div class="outline-text-2" id="text-20">
<ol class="org-ol">
<li>V :: Vocabulary of the corpus</li>
<li>N or |V| :: Size of V</li>
</ol>
</div>
</div>
</div>
</body>
</html>